In [231]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

## Data defition and cleaning

In [232]:
df = pd.read_excel('data/HARGA RUMAH JAKSEL.xlsx')
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,HARGA,LT,LB,JKT,JKM,GRS,KOTA
1,28000000000,1100,700,5,6,ADA,JAKSEL
2,19000000000,824,800,4,4,ADA,JAKSEL
3,4700000000,500,400,4,3,ADA,JAKSEL
4,4900000000,251,300,5,4,ADA,JAKSEL
...,...,...,...,...,...,...,...
997,16000000000,488,550,6,5,ADA,JAKSEL
998,4500000000,209,270,4,4,ADA,JAKSEL
999,29000000000,692,400,4,3,TIDAK ADA,JAKSEL
1000,1700000000,102,140,4,3,TIDAK ADA,JAKSEL
1001,1250000000,63,110,3,3,TIDAK ADA,JAKSEL

In [233]:
df.rename(columns={'Unnamed: 0': 'harga_rumah', 
                   'Unnamed: 1': 'luas_tanah', 
                   'Unnamed: 2': 'luas_bangunan', 
                   'Unnamed: 3': 'jumlah_kamar_tidur', 
                   'Unnamed: 4': 'jumlah_kamar_mandi',
                   'Unnamed: 5': 'garasi',	
                   'Unnamed: 6': 'kota'
                   }, 
                   inplace=True)
df

,harga_rumah,luas_tanah,luas_bangunan,jumlah_kamar_tidur,jumlah_kamar_mandi,garasi,kota
0,HARGA,LT,LB,JKT,JKM,GRS,KOTA
1,28000000000,1100,700,5,6,ADA,JAKSEL
2,19000000000,824,800,4,4,ADA,JAKSEL
3,4700000000,500,400,4,3,ADA,JAKSEL
4,4900000000,251,300,5,4,ADA,JAKSEL
...,...,...,...,...,...,...,...
997,16000000000,488,550,6,5,ADA,JAKSEL
998,4500000000,209,270,4,4,ADA,JAKSEL
999,29000000000,692,400,4,3,TIDAK ADA,JAKSEL
1000,1700000000,102,140,4,3,TIDAK ADA,JAKSEL
1001,1250000000,63,110,3,3,TIDAK ADA,JAKSEL

In [234]:
df.drop(0, inplace=True)
df.reset_index(drop=True, inplace=True)
df

,harga_rumah,luas_tanah,luas_bangunan,jumlah_kamar_tidur,jumlah_kamar_mandi,garasi,kota
0,28000000000,1100,700,5,6,ADA,JAKSEL
1,19000000000,824,800,4,4,ADA,JAKSEL
2,4700000000,500,400,4,3,ADA,JAKSEL
3,4900000000,251,300,5,4,ADA,JAKSEL
4,28000000000,1340,575,4,5,ADA,JAKSEL
...,...,...,...,...,...,...,...
996,16000000000,488,550,6,5,ADA,JAKSEL
997,4500000000,209,270,4,4,ADA,JAKSEL
998,29000000000,692,400,4,3,TIDAK ADA,JAKSEL
999,1700000000,102,140,4,3,TIDAK ADA,JAKSEL
1000,1250000000,63,110,3,3,TIDAK ADA,JAKSEL

In [235]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   harga_rumah         1001 non-null   object
 1   luas_tanah          1001 non-null   object
 2   luas_bangunan       1001 non-null   object
 3   jumlah_kamar_tidur  1001 non-null   object
 4   jumlah_kamar_mandi  1001 non-null   object
 5   garasi              1001 non-null   object
 6   kota                1001 non-null   object
dtypes: object(7)
memory usage: 54.9+ KB

In [236]:
df.harga_rumah = df.harga_rumah.astype(np.int64)
df.luas_tanah = df.luas_tanah.astype(np.int64)
df.luas_bangunan = df.luas_bangunan.astype(np.int64)
df.jumlah_kamar_tidur = df.jumlah_kamar_tidur.astype(np.int64)
df.jumlah_kamar_mandi = df.jumlah_kamar_mandi.astype(np.int64)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   harga_rumah         1001 non-null   int64
 1   luas_tanah          1001 non-null   int64
 2   luas_bangunan       1001 non-null   int64
 3   jumlah_kamar_tidur  1001 non-null   int64
 4   jumlah_kamar_mandi  1001 non-null   int64
 5   garasi              1001 non-null   object
 6   kota                1001 non-null   object
dtypes: int64(5), object(2)
memory usage: 54.9+ KB

In [237]:
df.drop('kota', axis=1, inplace=True)
df

,harga_rumah,luas_tanah,luas_bangunan,jumlah_kamar_tidur,jumlah_kamar_mandi,garasi
0,28000000000,1100,700,5,6,ADA
1,19000000000,824,800,4,4,ADA
2,4700000000,500,400,4,3,ADA
3,4900000000,251,300,5,4,ADA
4,28000000000,1340,575,4,5,ADA
...,...,...,...,...,...,...
996,16000000000,488,550,6,5,ADA
997,4500000000,209,270,4,4,ADA
998,29000000000,692,400,4,3,TIDAK ADA
999,1700000000,102,140,4,3,TIDAK ADA
1000,1250000000,63,110,3,3,TIDAK ADA

In [238]:
df.garasi.replace({'ADA': 1, 'TIDAK ADA': 0}, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   harga_rumah         1001 non-null   int64
 1   luas_tanah          1001 non-null   int64
 2   luas_bangunan       1001 non-null   int64
 3   jumlah_kamar_tidur  1001 non-null   int64
 4   jumlah_kamar_mandi  1001 non-null   int64
 5   garasi              1001 non-null   int64
dtypes: int64(6)
memory usage: 47.1 KB

C:\Users\dsapu\AppData\Local\Temp\ipykernel_6384\1712128810.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.garasi.replace({'ADA': 1, 'TIDAK ADA': 0}, inplace=True)
C:\Users\dsapu\AppData\Local\Temp\ipykernel_6384\1712128810.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.garasi.replace({'ADA': 1, 'TIDAK ADA': 0}, inplace=True)

## Regresion Algorithm

### Gradient Descent

In [239]:
def NormalEquation(X, y):
    """
    Normal Equation untuk Linear Regression: theta = (X^T X)^-1 X^T y
    
    Input:
      X : shape (m, n) - data training (sudah include intercept column jika diperlukan)
      y : shape (m,) - target
    Output:
      theta : shape (n,) - parameter
    """
    X = np.asarray(X, dtype=np.float64)
    y = np.asarray(y, dtype=np.float64).ravel()
    
    X = np.c_[np.ones((X.shape[0], 1)), X]
    # Normal Equation: theta = (X^T X)^-1 X^T y
    theta, _, _, _ = np.linalg.lstsq(X, y, rcond=None)
    
    return theta

### Regression

In [240]:
def Regression(X, theta):
    X = np.asarray(X)
    theta = np.asarray(theta)
    X = np.c_[np.ones((X.shape[0], 1)), X]

    return X.dot(theta)

## Data Scaling

In [241]:
class ZscoreNormal:
    def __init__(self):
        self.mean = None
        self.std = None
    def fit(self, X):
        self.mean = np.mean(X, axis=0)
        self.std = np.std(X, axis=0)
    def transform(self, X):
        return (X - self.mean) / self.std
    def fit_transform(self, X):
        self.fit(X)
        return self.transform(X)
    def inverse_transform(self, X_norm):
        return (X_norm * self.std) + self.mean

## fit

### train test split

In [242]:
# tanpa normalisasi
{'random_state': 2374, 'test_size': 0.1}
{'random_state': 908, 'test_size': 0.11}
# dengan normalisasi
{'random_state': 4332, 'test_size': 0.10500000000000001}
{'random_state': 936, 'test_size': 0.10500000000000001}
{'random_state': 831, 'test_size': 0.1}

{'random_state': 831, 'test_size': 0.1}

In [243]:
from sklearn.model_selection import train_test_split

X = df.drop('harga_rumah', axis=1).values
y = df['harga_rumah'].values

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.1, random_state=831)
scaler = ZscoreNormal()
X_train_norm = scaler.fit_transform(X_train)
X_test_norm = scaler.transform(X_test)

### train and test

In [244]:
theta = NormalEquation(X_train, y_train)
y_pred = Regression(X_test, theta)

## evaluation

In [245]:
def MSE(y_true, y_pred):
    return np.mean((y_true - y_pred) ** 2)
def RMSE(y_true, y_pred):
    return np.sqrt(MSE(y_true, y_pred))
def r2_score(y_true, y_pred):
    ss_total = np.sum((y_true - np.mean(y_true)) ** 2)
    ss_residual = np.sum((y_true - y_pred) ** 2)
    return 1 - (ss_residual / ss_total)
from sklearn.metrics import mean_absolute_percentage_error

In [246]:
mse = MSE(y_test, y_pred)
rmse = RMSE(y_test, y_pred)
r2 = r2_score(y_test, y_pred)
mape = mean_absolute_percentage_error(y_test, y_pred)
print("Mean Squared Error:", mse)
print("Root Mean Squared Error:", rmse)
print("R-squared:", r2)
print("MAPE:", mape)

Mean Squared Error: 1.5772825030330483e+19
Root Mean Squared Error: 3971501609.0051484
R-squared: 0.8365626673087929
MAPE: 0.2707833193720044